using System;

namespace example_5
{
    class Program
    {
        static void Main(string[] args)
        {
            // Домашняя работа №2 пример_5
            // Архиреев Аркадий 
            /* 5. а) Написать программу, которая запрашивает массу и рост человека, вычисляет его индекс массы и сообщает,
             * нужно ли человеку похудеть, набрать вес или всё в норме.
             *    б) *Рассчитать, на сколько кг похудеть или сколько кг набрать для нормализации веса.*/

        }
    }
}
